## Plan 📝
```bash
google_service_account.ga_cd_account: Refreshing state... [id=projects/apsitvarkom-dev/serviceAccounts/ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
data.google_iam_policy.noauth: Reading...
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-dev-bucket-tfstate]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/apsitvarkom-dev/locations/us-east1/repositories/docker-apsitvarkom-dev]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_iam_member.cloud_run_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/run.admin/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_project_iam_member.token_creator_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/iam.serviceAccountTokenCreator/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_repo_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/artifactregistry.repoAdmin/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_cloud_run_service_iam_policy.be_service_noauth: Refreshing state... [id=v1/projects/apsitvarkom-dev/locations/us-east1/services/apsitvarkom-be]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.be_service will be created
  + resource "google_cloud_run_service" "be_service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "apsitvarkom-be"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-east1-docker.pkg.dev/apsitvarkom-dev/docker-apsitvarkom-dev/apsitvarkom-be"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.fe_service will be created
  + resource "google_cloud_run_service" "fe_service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "apsitvarkom-fe"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-east1-docker.pkg.dev/apsitvarkom-dev/docker-apsitvarkom-dev/apsitvarkom-fe"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.be_service_noauth must be replaced
-/+ resource "google_cloud_run_service_iam_policy" "be_service_noauth" {
      ~ etag        = "BwXql4z7WmQ=" -> (known after apply)
      ~ id          = "v1/projects/apsitvarkom-dev/locations/us-east1/services/apsitvarkom-be" -> (known after apply)
      ~ policy_data = jsonencode(
          ~ {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      ~ project     = "apsitvarkom-dev" -> (known after apply) # forces replacement
      ~ service     = "v1/projects/apsitvarkom-dev/locations/us-east1/services/apsitvarkom-be" -> "apsitvarkom-be"
        # (1 unchanged attribute hidden)
    }

  # google_cloud_run_service_iam_policy.fe_service_noauth will be created
  + resource "google_cloud_run_service_iam_policy" "fe_service_noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-east1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "apsitvarkom-fe"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->